<?xml version="1.0" encoding="UTF-8"?>
<!-- $Id: chapter.switch.xml 342 2012-02-06 01:38:37Z netkiller $ -->
<chapter id="switch">
	<title>Switch</title>
	<para>CATALYST 3560</para>
	<section>
		<title>交换机初始化</title>
		<para>Cisco Catalyst 2960 Series Switches</para>
		<screen>
		<![CDATA[
Press RETURN to get started!


*Mar  1 00:00:25.073: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, cha                                                                                                 nged state to down
*Mar  1 00:00:26.189: %SPANTREE-5-EXTENDED_SYSID: Extended SysId enabled for typ                                                                                                 e vlan
*Mar  1 00:00:47.102: %SYS-5-RESTART: System restarted --
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 12.2(44)SE6, REL                                                                                                 EASE SOFTWARE (fc1)
Copyright (c) 1986-2009 by Cisco Systems, Inc.
Compiled Mon 09-Mar-09 18:10 by gereddy


         --- System Configuration Dialog ---

Would you like to enter the initial configuration dialog? [yes/no]:
Would you like to enter the initial configuration dialog? [yes/no]: yes

At any point you may enter a question mark '?' for help.
Use ctrl-c to abort configuration dialog at any prompt.
Default settings are in square brackets '[]'.


Basic management setup configures only enough connectivity
for management of the system, extended setup will ask you
to configure each interface on the system

Would you like to enter basic management setup? [yes/no]: yes
Configuring global parameters:

  Enter host name [Switch]:

  The enable secret is a password used to protect access to
  privileged EXEC and configuration modes. This password, after
  entered, becomes encrypted in the configuration.
  Enter enable secret: chen

  The enable password is used when you do not specify an
  enable secret password, with some older software versions, and
  some boot images.
  Enter enable password: chen
% Please choose a password that is different from the enable secret
  Enter enable password: chen

  The virtual terminal password is used to protect
  access to the router over a network interface.
  Enter virtual terminal password: chen
  Configure SNMP Network Management? [no]: yes
    Community string [public]:

Current interface summary

Interface              IP-Address      OK? Method Status                Protocol
Vlan1                  unassigned      YES unset  up                    down
FastEthernet0/1        unassigned      YES unset  down                  down
FastEthernet0/2        unassigned      YES unset  down                  down
FastEthernet0/3        unassigned      YES unset  down                  down
FastEthernet0/4        unassigned      YES unset  down                  down
FastEthernet0/5        unassigned      YES unset  down                  down
FastEthernet0/6        unassigned      YES unset  down                  down
FastEthernet0/7        unassigned      YES unset  down                  down
FastEthernet0/8        unassigned      YES unset  down                  down
FastEthernet0/9        unassigned      YES unset  down                  down
FastEthernet0/10       unassigned      YES unset  down                  down
FastEthernet0/11       unassigned      YES unset  down                  down
FastEthernet0/12       unassigned      YES unset  down                  down
FastEthernet0/13       unassigned      YES unset  down                  down
FastEthernet0/14       unassigned      YES unset  down                  down
FastEthernet0/15       unassigned      YES unset  down                  down
FastEthernet0/16       unassigned      YES unset  down                  down
FastEthernet0/17       unassigned      YES unset  down                  down
FastEthernet0/18       unassigned      YES unset  down                  down
FastEthernet0/19       unassigned      YES unset  down                  down
FastEthernet0/20       unassigned      YES unset  down                  down
FastEthernet0/21       unassigned      YES unset  down                  down
FastEthernet0/22       unassigned      YES unset  down                  down
FastEthernet0/23       unassigned      YES unset  down                  down
FastEthernet0/24       unassigned      YES unset  down                  down
GigabitEthernet0/1     unassigned      YES unset  down                  down
GigabitEthernet0/2     unassigned      YES unset  down                  down

Enter interface name used to connect to the
management network from the above interface summary: FastEthernet0/24

Configuring interface FastEthernet0/24:
  Configure IP on this interface? [no]: yes
    IP address for this interface: 172.16.0.253
    Subnet mask for this interface [255.255.0.0] :
    Class B network is 172.16.0.0, 16 subnet bits; mask is /16
Would you like to enable as a cluster command switch? [yes/no]: yes
Enter cluster name: cl1

The following configuration command script was created:

hostname Switch
enable secret 5 $1$W1RW$ZdWR.sS/g2RwJMv4F5sRq0
enable password chen
line vty 0 15
password chen
snmp-server community public
!
!
interface Vlan1
shutdown
no ip address
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
 --More--

		]]>		
		</screen>
		
		<section>
			<title>密码设置</title>
			<para>基本操作</para>
			<screen>
Switch command
Switch > en 进入特权模式
Switch # conf t 进入全局配置模式
Switch（config）# interface interface-num 进入接口
Switch（config）# hostname name 给交换机命名
Switch（config）# enable password password 设置明文密码
Switch（config）# enable secret password 设置加密的启用秘密口令。如果设置则取代明文口令
Switch # copy running-config startup-config 
Switch # write 保存设置
			</screen>			
		</section>
		<section>
			<title>域名，网管</title>
			<para>初始化设置</para>
			<screen>
Switch setup
switch（config）# ip default-gateway ip-address
switch（config）# ip domain-name domain-name
switch（config）# ip name-server IP-address 交换机上设置远程访问,用于交换机管理
			</screen>
		</section>
		<section id="switch.telnet">
			<title>命令行接口</title>
			<para>通过Telnet进入命令行接口</para>
			<screen>
Switch>enable
Switch#conf t
Switch(config)#line vty 0 4
Switch(config－line)#login
Switch(config－line)#password cisco		
			</screen>
		</section>	
		<section>
			<title>保存当前配置</title>
			<para>Save</para>
			<screen>
Switch#wr
Building configuration...
[OK]	
			</screen>			
		</section>
		<section>
			<title>恢复交换机出厂值</title>
			<screen>
Switch# erase startup-config			
			</screen>		
		</section>
	</section>
	<section>
		<title>interface</title>
		<section>
			<title>show interfaces status</title>
			<screen>
show interfaces status
			</screen>			
		</section>
		<section>
			<title>ip address</title>
			<para>DHCP</para>
			<screen>
ip address dhcp
			</screen>
			<para>指定IP地址</para>
			<screen>
ip address 192.20.135.21 255.255.255.0			
			</screen>
		</section>		
		<section>
			<title>配置端口速率及双工模式</title>
			<literallayout>
Step 1          configure terminal        						进入配置状态.
Step 2          interface interface-id        					进入端口配置状态.
Step 3          speed {10 | 100 | 1000 | auto | nonegotiate}    设置端口速率 注   1000 只工作在千兆口. GBIC模块只工作在1000 Mbps下. nonegotiate 只能在这些GBIC上用 1000BASE-SX, -LX, and -ZX GBIC.
Step 4          duplex {auto | full | half}        				设置全双工或半双工. 
Step 5          end       	 									退出
Step 6          show interfaces interface-id        			显示有关配置情况
Step 7          copy running-config startup-config        		保存
			</literallayout>
			<screen>
Switch# configure terminal
Switch(config)# interface fastethernet0/3
Switch(config-if)# speed 10
Switch(config-if)# duplex half
			</screen>
		</section>
		<section>
			<title>range</title>
			<screen>
Switch# configure terminal

Switch(config)# interface range fastethernet0/1 - 5 

Switch(config-if-range)# no shutdown 
Switch(config-if-range)#
*Oct  6 08:24:35: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Oct  6 08:24:35: %LINK-3-UPDOWN: Interface FastEthernet0/2, changed state to up
*Oct  6 08:24:35: %LINK-3-UPDOWN: Interface FastEthernet0/3, changed state to up
*Oct  6 08:24:35: %LINK-3-UPDOWN: Interface FastEthernet0/4, changed state to up
*Oct  6 08:24:35: %LINK-3-UPDOWN: Interface FastEthernet0/5, changed state to up
*Oct  6 08:24:36: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/05, 
changed state to up
*Oct  6 08:24:36: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed 
state to up
*Oct  6 08:24:36: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/4, changed 
state to up
			</screen>
			<para>同事选择多个端口</para>
			<screen>
Switch# configure terminal

Switch(config)# interface range fastethernet0/1 - 3, gigabitethernet0/1 - 2 

Switch(config-if-range)# no shutdown 
Switch(config-if-range)#
*Oct  6 08:29:28: %LINK-3-UPDOWN: Interface FastEthernet0/1, changed state to up
*Oct  6 08:29:28: %LINK-3-UPDOWN: Interface FastEthernet0/2, changed state to up
*Oct  6 08:29:28: %LINK-3-UPDOWN: Interface FastEthernet0/3, changed state to up
*Oct  6 08:29:28: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to up
*Oct  6 08:29:28: %LINK-3-UPDOWN: Interface GigabitEthernet0/2, changed state to up
*Oct  6 08:29:29: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/ 1, 
changed state to up
*Oct  6 08:29:29: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/ 2, 
changed state to up
*Oct  6 08:29:29: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/ 3, 
changed state to up		
			</screen>
		</section>
	</section>
	<section>
		<title>DHCP</title>
		<para>关闭DHCP服务</para>
		<screen>
no service dhcp		
		</screen>
		<para>开启DHCP服务</para>
		<screen>
Switch(config)#service dhcp
		</screen>
 
		<screen>
		<![CDATA[
ip dhcp pool global //global是pool name， 由用户指定

　　 network 10.1.0.0 255.255.0.0 //动态分配的地址段

	default-router 10.1.1.100 10.1.1.101 //为客户机配置默认网关
	
　　 domain-name client.com //为客户机配置域后缀

　　 dns-server 10.1.1.1 10.1.1.2 //为客户机配置dns服务器

　　 netbios-name-server 10.1.1.5 10.1.1.6 //为客户机配置wins服务器

　　 netbios-node-type h-node //为客户机配置节点模式（影响名称解释的顺利,如h-node=先通过wins服务器解释...）

　　 lease 3 //地址租用期限: 3天
		]]>
		</screen>
		
		<para>VLAN 指定DHCP地址</para>
		<screen>
		<![CDATA[
 ip helper-address 10.1.1.8 //假设这是DHCP客户机所在的VLAN
		]]>
		</screen>	
		
	<section>
		<title>Gateway</title>
		<para>显示地址分配情况</para>
		<screen>
show ip dhcp binding		
		</screen>
		<para>显示地址冲突情况</para>
		<screen>
show ip dhcp conflict		
		</screen>
		<para>观察DHCP服务器工作情况</para>
		<screen>
debug ip dhcp server {events | packets | linkage} 		
		</screen>			
	</section>
		<section>
			<title>snooping</title>
			<screen>
Switch(config)#ip dhcp snooping
Switch(config)#ip dhcp snooping vlan 2
Switch(config)#ip dhcp snooping vlan 3
or
Switch(config)#ip dhcp snooping vlan 2-3
Switch(config)#ip dhcp snooping verify mac-address
Switch(config)#ip dhcp snooping information option
Switch(config)#int range f0/1-12
Switch(config-if-range)#ip dhcp snooping trust
Switch(config-if-range)#ip dhcp snooping limit rate 15			
			</screen>
		</section>
	</section>
	<section>
		<title>Route port</title>
		<para>no switchport</para>
		<screen>
		<![CDATA[
Switch# configure terminal

Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)# interface gigabitethernet0/2

Switch(config-if)# no switchport

Switch(config-if)# ip address 192.20.135.21 255.255.255.0

Switch(config-if)# no shutdown

Switch(config-if)# end 
		]]>
		</screen>
	</section>		
	<section>
		<title>交换机端口镜像配置</title>
		<para>举例：通过交换机的第2号口监控第1号口的流量</para>
		<screen>
		<![CDATA[
Switch(config)# monitor session 1 source interface gigabitethernet0/1
Switch(config)# monitor session 1 destination interface gigabitethernet0/2 
Switch(config)# end
		]]>
		</screen>	
		<para>删除一个span会话: </para>
		<screen>
		<![CDATA[
Switch(config)# no monitor session 1 source interface gigabitethernet0/1
Switch(config)# end
		]]>
		</screen>
	</section>	
	<section>
		<title>Ethernet Port Groups</title>
		<!-- <para>Figure 33-1 Typical EtherChannel Configuration</para> -->
		<para>SwitchA</para>
		<screen>
		<![CDATA[
SwitchA# configure terminal
SwitchA (config)# interface range gigabitethernet0/1 -2
SwitchA (config-if-range)# switchport mode access
SwitchA (config-if-range)# switchport access vlan 10
SwitchA (config-if-range)# channel-group 5 mode ON
Switch(config-if-range)# end
		]]>
		</screen>
		<para>SwitchB</para>
		<screen>
		<![CDATA[
SwitchB# configure terminal
SwitchB(config)# interface range gigabitethernet0/1 -2
SwitchB(config-if-range)# switchport
		]]>
		</screen>		
	</section>	
	<section>
		<title>VLAN</title>
		<section>
			<title>vlan database</title>
		<screen>
		<![CDATA[
Switch#vlan database
% Warning: It is recommended to configure VLAN from config mode,
  as VLAN database mode is being deprecated. Please consult user
  documentation for configuring VTP/VLAN in config mode.

Switch(vlan)#
*Mar  1 00:29:54.407: %SYS-5-CONFIG_I: Configured from console by console
Switch(vlan)#show
  VLAN ISL Id: 1
    Name: default
    Media Type: Ethernet
    VLAN 802.10 Id: 100001
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 2
    Name: server
    Media Type: Ethernet
    VLAN 802.10 Id: 100002
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 3
    Name: office
    Media Type: Ethernet
    VLAN 802.10 Id: 100003
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1002
    Name: fddi-default
    Media Type: FDDI
    VLAN 802.10 Id: 101002
    State: Operational
    MTU: 1500
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1003
    Name: token-ring-default
    Media Type: Token Ring
    VLAN 802.10 Id: 101003
    State: Operational
    MTU: 1500
    Maximum ARE Hop Count: 7
    Maximum STE Hop Count: 7
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1004
    Name: fddinet-default
    Media Type: FDDI Net
    VLAN 802.10 Id: 101004
    State: Operational
    MTU: 1500
    STP Type: IEEE
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

  VLAN ISL Id: 1005
    Name: trnet-default
    Media Type: Token Ring Net
    VLAN 802.10 Id: 101005
    State: Operational
    MTU: 1500
    STP Type: IBM
    Backup CRF Mode: Disabled
    Remote SPAN VLAN: No

Switch(vlan)# 
		]]>
		</screen>		
		</section>
	<section>
		<title>两层Switch配置讲解</title>
		<para>路由器配制</para>
		<screen>
		<![CDATA[
Router#configure terminal

Router(config)#interface f0/0

Router(config-if)#no shutdown

Router(config-if)#interface f0/0.1 --------------- 创建子接口1

Router(config-subif)#encapsulation dot1q 2  ------ 2为VLAN号 对应VLAN 2

Router(config-subif)#ip address 10.10.11.1 255.255.255.0

Router(config-if)#interface f0/0.2 ---------------- 创建子接口2

Router(config-subif)#encapsulation dot1q 3  ------- 3为VLAN号 对应VLAN 3

Router(config-subif)#ip address 10.10.10.1 255.255.255.0

路由器已经配制完毕，可以在Router#show run 看一下当前的配制，用Router#show interfaces 看当前端口的状态，f0/0.1 和f0/0.2两个子

接口是否为up状态。 
		]]>
		</screen>
		<para>交换机配制</para>
		<screen>
		<![CDATA[
Switch#vlan database

Switch(vlan)#vlan 2  name 财务部 ------- 创建vlan 2为财务部

Switch(vlan)#vlan 3 name  市场部----------创建vlan 3为市场部

Switch(vlan)#exit

Switch configure terminal

Switch(coning)#interface  range f0/2 - 9 

Switch(coning-if)#switch port access vlan 2 ------- 将f0/-f0/9端口分到vlan 2中

Switch(config-if)#interface range f0/10 - 14

Switch(config-if)#switchport access vlan 3 --------将端f0/10至f0/14口3分到vlan 3中

Switch(config-if)#interface f0/1

Switch(config-if)#switchport trunk encapsulation dot1q ------将端口封装

Switch(config-if)#switchport mode trunk  -------- 将端口配制为trunk模式
		]]>
		</screen>	
		<para>客户端配制：</para>
		<screen>
		<![CDATA[
WorKstation 1 配制为：10.10.11.3 255.255.255.0 网关：10.10.11.1
Workstation 2 配制为：10.10.10.3 255.255.255.0 网关：10.10.10.1
		]]>
		</screen>
	</section>
	<section>
		<title>3 Layer Switch</title>		
		<para>3560交换机VLAN间路由的具体设置</para>
		<para>路由, VLAN, 交换机, 设置
在3560交换机上划三个VLAN，并且要求其中两个VLAN间能够互相访问，操作如下，请指点：</para>		
		<procedure>
			<title>Switch VLan 配置步骤</title>
			<step>
				<para>激活vlan路由 </para>
				<screen>
Switch1#config t
Switch1(config)#ip routing 				
				</screen>
			</step>
			<step>
				<para>创建三个VLAN</para>
				<screen>
Switch1# 

Switch1#vlan database 

Switch1(vlan)#vlan 2 

Switch1(vlan)#vlan 3 

Switch1(vlan)#vlan 10 

Switch1(vlan)#exit 				
				</screen>
			</step>
			<step>
				<para>给VLAN分配IP</para>
				<screen>
Switch1#config t 

Switch1(config)#config vlan2 

Switch1(config-if)#ip address 192.168.2.1 255.255.255.0 

Switch1(config-if)#no shutdown 


Switch1#config t 

Switch1(config)#config vlan3 

Switch1(config-if)#ip address 192.168.3.1 255.255.255.0 

Switch1(config-if)#no shutdown 		
				</screen>			
			</step>
			<step>
				<para>配VTP</para>
				<screen>
Switch1# 

Switch1#config t 

Switch1(config)#vtp domain SMG 

Switch1(config)#vtp mode server 

Switch1(config)#end 
				</screen>			
			</step>
			<step>
				<para>交换机通往路由器的接口配IP</para>
				<screen>
				<![CDATA[
Switch1# 

Switch1#config t 

Switch1(config)#interface fastethernet0/1 

Switch1(config-if)#no switchport 

Switch1(config-if)#ip address 200.1.1.1 255.255.255.0 

Switch1(config-if)#no shutdown 
				]]>
				</screen>			
			</step>
			<step>
				<para>交换机配置缺省路由</para>
				<screen>
				<![CDATA[
Switch1# 

Switch1#config t 

Switch(config)#ip route 0.0.0.0 0.0.0.0 200.1.1.2 
				]]>
				</screen>			
			</step>
			<step>
				<para>把VLAN号分配给IP接口 </para>
				<screen>
				<![CDATA[
Switch1# 

Switch1#config t 

Switch1(config)#interface fastethernet0/2 

Switch1(config-if)#switchport mode access 

Switch1(config-if)#switchport access vlan2 

Switch1(config-if)#spanning-tree portfast 

… … 

Switch1# 

Switch1#config t 

Switch1(config)#interface fastethernet0/13 

Switch1(config-if)#switchport mode access 

Switch1(config-if)#switchport access vlan3 

Switch1(config-if)#spanning-tree portfast 		
				]]>
				</screen>			
			</step>
			<step>
				<para>配访问控制列表ACL禁VLAN3子网的客户机访问服务器</para>
				<screen>
				<![CDATA[
Switch1# 

Switch1#config t 

Switch1(config)#access-list 1 deny 192.168.3.0 0.0.0.255 

Switch1(config)#access-list 1 permit any 

Switch1(config)#interface fastethernet0/13 （此接口接服务器） 

Switch1(config-if)#ip access-group 1 out 		
				]]>
				</screen>			
			</step>
			<step>
				<para>检查上述配置 </para>
				<screen>
				<![CDATA[
Switch1#show vlan 

Switch1#show ip route 

Switch1#show interface gigabitethernet0/1 switchport 

Switch1#show run 

Switch1#show vtp status 		
				]]>
				</screen>			
			</step>
			<step>
				<para>存配置 </para>
				<screen>
				<![CDATA[
Switch1#copy running-config startup-config			
				]]>
				</screen>			
			</step>						
		</procedure>	
		</section>	
	</section>
	<section>
		<title>VTP</title>
		<para>VLAN Trunking Protocol（VLAN 中继协议）</para>
		<screen>
		</screen>				
	</section>
	<section>
		<title>流量控制</title>
		<screen>
		<![CDATA[

		]]>
		</screen>
		<section>
			<title>粗糙的流量限制</title>
			<screen>
Switch(config-if)#speed ?
  10    Force 10 Mbps operation
  100   Force 100 Mbps operation
  auto  Enable AUTO speed configuration

Switch(config-if)#speed 10
			</screen>
		</section>
	</section>		
</chapter>
